import React from "react";
import Image from "next/image";
import Link from "next/link";
import Menu from "@/components/Menu";
import { useMenuStore } from "@/store/useMenuStore";
import { useEffect } from "react";

import IconSrc from "@/assets/images/goBackIcon.svg";

import styles from "./styles.module.css";

type ViewProps = {
  data: any;
};

const NewsItem = ({ data }: ViewProps) => {
  const { setActiveMenuItem } = useMenuStore();
  useEffect(() => {
    setActiveMenuItem("3");
  }, [setActiveMenuItem]);

  return (
    <div className={styles.wrapper}>
      <div className={styles.menuBox}>
        <Menu />
      </div>
      <div className={styles.container}>
        <div key={data.slug} className={styles.item}>
          <Link href={"/about-project"} className={styles.iconWrapper}>
            <Image src={IconSrc} className={styles.icon} alt="" />
          </Link>
          <div className={styles.innerImg}>
            <Image src={data.src} className={styles.image} alt="" />
          </div>
          <div className={styles.titleWrapper}>
            <h3 className={styles.title}>{data.title}</h3>
            <p className={styles.date}>{data.date}</p>
          </div>
          <div className={styles.textWrapper}>
            <p className={styles.description}>
              კომპანია მაილსთოუნი წავკისში  ექსკლუზიურ პროექტს იწყებს. ტყეში
              ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს,
              უნიკალური ხედებით თბილისზე. 
              <br />
              დახურული კომუნის ერთიან იერსახეს კარგად გააზრებული არქიტექტურული
              გადაწყვეტები ქმნის.  პროექტი საერთო სარგებლობის სოცილაურ და
              გასართობ სივრცეებს მოიცავს და გააჩნია პირდაპირი წვდომა ტყესთან.
              <br />
              ჩვენი ფილოსოფია ეყრდნობა ლანდშაფტზე ორიენტირების იდეას და
              ეწინააღმდეგება უხეშ ჩარევას მის ცვლილებაში. არქიტექტურის რელიეფთან
              ადაპტაცია უნიკალურ ხიბლს აძლევს თითოეულ სახლს და შემდეგ უკვე
              პროექტს ერთიან იერსახეს.
              <br />
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. კომპანია
              მაილსთოუნი წავკისში  ექსკლუზიურ პროექტს იწყებს.
              <br />
              ტყეში ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას
              მდებარეობს, უნიკალური ხედებით თბილისზე.  დახურული კომუნის ერთიან
              იერსახეს კარგად გააზრებული არქიტექტურული გადაწყვეტები ქმნის. 
              პროექტი საერთო სარგებლობის სოცილაურ და გასართობ სივრცეებს მოიცავს
              და გააჩნია პირდაპირი წვდომა ტყესთან. ჩვენი ფილოსოფია ეყრდნობა
              ლანდშაფტზე ორიენტირების იდეას და ეწინააღმდეგება უხეშ ჩარევას მის
              ცვლილებაში. არქიტექტურის რელიეფთან ადაპტაცია უნიკალურ ხიბლს აძლევს
              თითოეულ სახლს და შემდეგ უკვე პროექტს ერთიან იერსახეს.
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
              <br />
              ტყეში ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას
              მდებარეობს, უნიკალური ხედებით თბილისზე.  დახურული კომუნის ერთიან
              იერსახეს კარგად გააზრებული არქიტექტურული გადაწყვეტები ქმნის. 
              პროექტი საერთო სარგებლობის სოცილაურ და გასართობ სივრცეებს მოიცავს
              და გააჩნია პირდაპირი წვდომა ტყესთან. ჩვენი ფილოსოფია ეყრდნობა
              ლანდშაფტზე ორიენტირების იდეას და ეწინააღმდეგება უხეშ ჩარევას მის
              ცვლილებაში. არქიტექტურის რელიეფთან ადაპტაცია უნიკალურ ხიბლს აძლევს
              თითოეულ სახლს და შემდეგ უკვე პროექტს ერთიან იერსახეს.
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
              <br />
              ტყეში ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას
              მდებარეობს, უნიკალური ხედებით თბილისზე.  დახურული კომუნის ერთიან
              იერსახეს კარგად გააზრებული არქიტექტურული გადაწყვეტები ქმნის. 
              პროექტი საერთო სარგებლობის სოცილაურ და გასართობ სივრცეებს მოიცავს
              და გააჩნია პირდაპირი წვდომა ტყესთან. ჩვენი ფილოსოფია ეყრდნობა
              ლანდშაფტზე ორიენტირების იდეას და ეწინააღმდეგება უხეშ ჩარევას მის
              ცვლილებაში. არქიტექტურის რელიეფთან ადაპტაცია უნიკალურ ხიბლს აძლევს
              თითოეულ სახლს და შემდეგ უკვე პროექტს ერთიან იერსახეს.
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
              <br />
              მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
              განვითარების კომპანია,რომელიც  ქმნის და ავითარებს უნიკალურ
              კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. End
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default NewsItem;
