import { useState } from "react";
import { Swiper, SwiperSlide } from "swiper/react";
import { motion } from "framer-motion";
import { Navigation } from "swiper/modules";
import Image from "next/image";
import LightGallery from "@/components/LightGallery";

import styles from "./styles.module.css";

const images = [
  { url: "/images/about-project-slide.png", alt: "" },
  { url: "/images/about-project-slide-2.png", alt: "" },
  { url: "/images/about-project-slide.png", alt: "" },
  { url: "/images/about-project-slide-2.png", alt: "" },
  { url: "/images/about-project-slide.png", alt: "" },
  { url: "/images/about-project-slide.png", alt: "" },
  { url: "/images/about-project-slide-2.png", alt: "" },
  { url: "/images/about-project-slide.png", alt: "" },
  { url: "/images/about-project-slide-2.png", alt: "" },
  { url: "/images/about-project-slide.png", alt: "" },
];

const About = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);

  const handleLightGallery = (index) => setOpenIndex(index);
  const handleClose = () => setOpenIndex(null);

  return (
    <motion.div
      initial={{
        opacity: 0,
      }}
      animate={{
        opacity: 1,
        transition: { duration: 0.4, ease: "easeOut" },
      }}
      className={styles.wrapper}
    >
      <div>
        <LightGallery
          images={images}
          openIndex={openIndex}
          onClose={handleClose}
        />
        <Swiper
          className={styles.swiper}
          spaceBetween={16}
          modules={[Navigation]}
          slidesPerView={"auto"}
        >
          {images.map((image, i) => (
            <SwiperSlide className={styles.swiperSlide} key={i}>
              <Image
                onClick={() => handleLightGallery(i)}
                src={image.url}
                alt={image.alt}
                className={styles.image}
                width={908}
                height={490}
              />
            </SwiperSlide>
          ))}
        </Swiper>
      </div>
      <div className={styles.textWrapper}>
        <p className={styles.text}>
          კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული
          ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური
          ხედებით თბილისზე. დახურული კომუნის ერთიან იერსახეს კარგად გააზრებული
          არქიტექტურული გადაწყვეტები ქმნის.
          <br />
          ჩვენი ფილოსოფია ეყრდნობა ლანდშაფტზე ორიენტირების იდეას და
          ეწინააღმდეგება უხეშ ჩარევას მის ცვლილებაში. არქიტექტურის რელიეფთან
          ადაპტაცია უნიკალურ ხიბლს აძლევს თითოეულ სახლს და შემდეგ უკვე პროექტს
          ერთიან იერსახეს.
          <br />
          <br />
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          <br />
          კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული
          ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური
          ხედებით თბილისზე. დახურული კომუნის ერთიან იერსახეს კარგად გააზრებული
          არქიტექტურული გადაწყვეტები ქმნის. პროექტი საერთო სარგებლობის სოცილაურ
          და გასართობ სივრცეებს მოიცავს და გააჩნია პირდაპირი წვდომა ტყესთან.
          ჩვენი ფილოსოფია ეყრდნობა ლანდშაფტზე ორიენტირების იდეას და
          ეწინააღმდეგება უხეშ ჩარევას მის ცვლილებაში. არქიტექტურის რელიეფთან
          ადაპტაცია უნიკალურ ხიბლს აძლევს თითოეულ სახლს და შემდეგ უკვე პროექტს
          ერთიან იერსახეს.
          <br />
          <br />
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე
          ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც
          ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი
          ცხოვრების სტანდარტს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი
          ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს
          უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
          მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და
          განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს,
          ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.
        </p>
      </div>
    </motion.div>
  );
};

export default About;
