{
  "main-page": "Main Page",
  "landing-title": "Close enough to stay connected, Far enough to truly escape",
  "landing-text-1": "Milestone is launching an exclusive residential project on the southern slope of Tsavkisi. Located on a sunlit hillside, the project includes 63 individual land plots offering panoramic views of the forest and the city.",
  "landing-text-2": "Project : Tsavkisi is a thoughtfully planned community with a unified architectural identity, fully integrated into the natural landscape. It is designed for those who wish to build their dream home in a peaceful, nature-rich setting without losing connection to the city.",
  "architect-section-title": "Landscape oriented architecture",
  "architect-section-text": "The architectural vision of Project : Tsavkisi is rooted in a landscape-oriented approach. To create a unique living environment, we have developed a set of architectural guidelines - a Design Code, where every element is thoughtfully connected to the next. This framework helps our future residents build homes that contribute to a distinct and harmonious lifestyle in a natural, suburban setting.",
  "architect-section-button": "See more",
  "architect-section-mobile-text": "The architectural vision of <br /> Project : Tsavkisi is rooted in a landscape-oriented approach. To create a unique living environment, we have developed a set of architectural guidelines - a Design Code, where every element is thoughtfully connected to the next. This framework helps our future residents build homes that contribute to a distinct and harmonious lifestyle in a natural, suburban setting.",
  "sales-section-main-title": "Presale is open",
  "sales-section-title": "Land Plots on the Forest Edge",
  "sales-section-text": "Choose the location that best suits your lifestyle - a quiet plot nestled by the forest, or an elevated plot offering panoramic views of the city, each offering direct access to nature and a unique sense of tranquility.",
  "sales-button-title": "Select land",
  "collaborations-section-title": "კოლაბორაციები არქიტექტურულ სტუდიებთან",
  "collaborations-section-text": "გაეცანი სპეციალურად პროექტ:წავკისისთვის შექმნილ ინდივიდუალურ სახლის პროექტებსა და მათ ავტორებს.  კოლაბორაციის შედეგად, სხვადასხვა სპექტრის და მიმართულებების მქონე წამყვანმა სტუდიებმა შემქნეს ინდივიდუალური კონცეპციები. შენობების გემოეტრია მიღებულია ჩვენი დიზაინკოდისა და ლანდშაფტური არქიტექტურის პრინციპების გათვალისწინებით.",
  "collaborations-section-button": "გაიგე მეტი"
}
