import imgSrc1 from "@/assets/images/news-img-1.png";
import imgSrc2 from "@/assets/images/news-img-2.png";
import imgSrc3 from "@/assets/images/news-img-3.png";
import imgSrc4 from "@/assets/images/news-img-4.png";

export const newsData = [
  {
    slug: "news-1",
    src: imgSrc1,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში  ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. დახურული კომუნის ერთიან იერსახეს კარგად გააზრებული არქიტექტურული გადაწყვეტები ქმნის. პროექტი საერთო სარგებლობის სოცილაურ და გასართობ სივრცეებს მოიცავს და გააჩნია პირდაპირი წვდომა ტყესთან. ჩვენი ფილოსოფია ეყრდნობა ლანდშაფტზე ორიენტირების იდეას და ეწინააღმდეგება უხეშ ჩარევას მის ცვლილებაში. არქიტექტურის რელიეფთან ადაპტაცია უნიკალურ ხიბლს აძლევს თითოეულ სახლს და შემდეგ უკვე პროექტს ერთიან იერსახეს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს. კომპანია მაილსთოუნი წავკისში  ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდვიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. დახურული კომუნის ერთიან იერსახეს კარგად გააზრებული არქიტექტურული გადაწყვეტები ქმნის. პროექტი საერთო სარგებლობის სოცილაურ და გასართობ სივრცეებს მოიცავს და გააჩნია პირდაპირი წვდომა ტყესთან. ჩვენი ფილოსოფია ეყრდნობა ლანდშაფტზე ორიენტირების იდეას და ეწინააღმდეგება უხეშ ჩარევას მის ცვლილებაში. არქიტექტურის რელიეფთან ადაპტაცია უნიკალურ ხიბლს აძლევს თითოეულ სახლს და შემდეგ უკვე პროექტს ერთიან იერსახეს. მაილსტოუნი არის შინაარსზე ორიენტირებული უძრავი ქონების მართვის და განვითარების კომპანია,რომელიც ქმნის და ავითარებს უნიკალურ კონცეფციებს, ამკვიდრებთ სრულფასოვანი ცხოვრების სტანდარტს.",
  },
  {
    slug: "news-2",
    src: imgSrc2,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდივიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. ",
  },
  {
    slug: "news-3",
    src: imgSrc3,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდივიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. ",
  },
  {
    slug: "news-4",
    src: imgSrc4,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდივიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. ",
  },
  {
    slug: "news-5",
    src: imgSrc1,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდივიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. ",
  },
  {
    slug: "news-6",
    src: imgSrc2,
    title: "ᲞᲠᲝᲔᲥᲢᲘ ᲬᲐᲕᲙᲘᲡᲘ",
    date: "01.05.2025",
    description:
      "კომპანია მაილსთოუნი წავკისში ექსკლუზიურ პროექტს იწყებს. ტყეში ჩაფლული ინდივიდუალური მიწის ნაკვეთი წავკისის განაპირას მდებარეობს, უნიკალური ხედებით თბილისზე. ",
  },
];
